[{"Title":"You are not \"family\" to your company. If you have an opportunity to better yourself, take it. They will do the same when it comes to cutting ties with you.","Score":75463,"Num_Comments":600.0,"Date":1583280000000},{"Title":"Warning: AT&T applying \"customer loyalty speed upgrades\" without customer consent","Score":62181,"Num_Comments":2395.0,"Date":1514764800000},{"Title":"If you’re ripped off by Comcast (or any internet company), Wells Fargo (or any bank\/student lender), or Aetna (or any health insurance company), here’s how to get your money back.","Score":56231,"Num_Comments":2312.0,"Date":1522540800000},{"Title":"U.S. Breaks Up Fake I.R.S. Phone Scam Operation -- 21 people sentenced for up to 20 yrs, 32 in India indicted","Score":55457,"Num_Comments":838.0,"Date":1532304000000},{"Title":"I made a spreadsheet for people who don't know how to budget!","Score":50765,"Num_Comments":1616.0,"Date":1557878400000},{"Title":"Quick Reminder to Not Give Away Your Salary Requirement in a Job Interview","Score":44447,"Num_Comments":3649.0,"Date":1520467200000},{"Title":"Bank of America just imposed a new $60 annual fee on their previously free personal savings account.","Score":41963,"Num_Comments":3530.0,"Date":1510876800000},{"Title":"For everyone shopping on Amazon's Prime Day: \"savings\" from sales aren't savings if you weren't already planning on buying the item.","Score":39520,"Num_Comments":1900.0,"Date":1531699200000},{"Title":"In most cases, it will cost your employer far more to replace you than it would to give you a raise. So ask firmly.","Score":37080,"Num_Comments":2017.0,"Date":1515628800000},{"Title":"IRS will allow employers to match their employees' student loan repayments","Score":36850,"Num_Comments":1583.0,"Date":1535414400000},{"Title":"I mde a spreadsheet for people who dont know how to budget! Ver. 2.0","Score":36713,"Num_Comments":1239.0,"Date":1572393600000},{"Title":"Forbes: Employees who stay at a company for more than 2 years on average earn 50% less.","Score":36387,"Num_Comments":3831.0,"Date":1500163200000},{"Title":"Last month, I spent $770 eating out. This month, I've spent $42. This is only the first of many financial self control habits I'm trying to get myself into!","Score":34942,"Num_Comments":2256.0,"Date":1497744000000},{"Title":"Be careful what you say in public","Score":34140,"Num_Comments":1664.0,"Date":1565049600000},{"Title":"When heading into Black Friday sales, it's not a sale if you didn't plan to buy the item in the first place.","Score":33789,"Num_Comments":1229.0,"Date":1542931200000},{"Title":"TransUnion burying their credit freeze to sell their own credit monitoring product TrueIdentity","Score":30756,"Num_Comments":1966.0,"Date":1505260800000},{"Title":"Warren Buffet just won his ten-year bet about index funds outperforming hedge funds","Score":29907,"Num_Comments":1456.0,"Date":1518998400000},{"Title":"Girlfriend applied for a job, within 24 hours they hired her, and sent her a check for $4,000 to buy supplies. Scam?","Score":29423,"Num_Comments":1887.0,"Date":1490832000000},{"Title":"This is just a reminder that Bank of America charges $144 a year to have a basic checking account, and will change your account type over automatically after you graduate, or charge you when you're looking for a job","Score":28456,"Num_Comments":2896.0,"Date":1495152000000},{"Title":"If you can't get your emergency fund to grow because of emergencies that keep coming up, you're still doing a good job.","Score":28425,"Num_Comments":637.0,"Date":1538956800000},{"Title":"Please, for the sake of your wallet, meal prep.","Score":28016,"Num_Comments":2724.0,"Date":1499558400000},{"Title":"To all the graduating high school seniors and those turning 18 - Get a bank account that's only in your name.","Score":27688,"Num_Comments":1345.0,"Date":1558310400000},{"Title":"If you start suddenly getting email\/spam \"bombed\" there's probably a reason","Score":27668,"Num_Comments":900.0,"Date":1555891200000},{"Title":"Don’t look at your 401k balances today; it has no impact on your long-term investment outlook","Score":27433,"Num_Comments":1769.0,"Date":1583712000000},{"Title":"Your parents took decades to furnish their house","Score":27392,"Num_Comments":1963.0,"Date":1499904000000},{"Title":"Heads up: The federal government just filed suit against Navient, claiming they scammed millions of borrowers between 2010-2015 to the tune of $4 billion. This is huge.","Score":27033,"Num_Comments":1944.0,"Date":1484697600000},{"Title":"This article perfectly shows how Uber and Lyft are taking advantage of drivers that don't understand the real costs of the business.","Score":26831,"Num_Comments":2559.0,"Date":1570492800000},{"Title":"My lyft\/uber expenses were nearly $750 every month so I instead bought a bike for $900 and now my travel expenses are <$140","Score":26689,"Num_Comments":1215.0,"Date":1504656000000},{"Title":"Reddit is advertising really bad IRA advice. Please do not follow their suggested adds.","Score":26617,"Num_Comments":1222.0,"Date":1490659200000},{"Title":"My Dad just figured out he's been paying $30\/month for AOL dial-up internet he hasn't used for at least the last ten years.","Score":26316,"Num_Comments":2156.0,"Date":1485043200000},{"Title":"Your amazon store card is probably scamming you","Score":26153,"Num_Comments":1536.0,"Date":1536105600000},{"Title":"Got laid off and now the company that laid me off is trying to hire me back at a discount.","Score":25975,"Num_Comments":2011.0,"Date":1517356800000},{"Title":"Claims are now being accepted for the 2017 Equifax breach - you could receive $125 or more.","Score":25224,"Num_Comments":1904.0,"Date":1563926400000},{"Title":"Someone used my credit card and ordered two 256gb iPhone X's to my house.","Score":24996,"Num_Comments":1785.0,"Date":1516492800000},{"Title":"I thought I was paranoid, but I got phished. Read my shameful account of said phishing so they don't get you too.","Score":24468,"Num_Comments":1871.0,"Date":1519171200000},{"Title":"Khan Academy has basic explanations on taxes in the U.S. This should help you with understanding tax brackets, deductions, and other related information.","Score":24300,"Num_Comments":567.0,"Date":1582761600000},{"Title":"A story of how I just got out of paying a $1500 bill, why you should NEVER blindly trust a Debt collection agency, and ALWAYS request proof of a Debt owed. 😂😂😂","Score":23195,"Num_Comments":1167.0,"Date":1539129600000},{"Title":"(Update) Found out I was being paid less than entry level employees, what do I do?","Score":22717,"Num_Comments":945.0,"Date":1487289600000},{"Title":"My boss game me a $100 “Christmas bonus” and then took $100 advance out of my next check.","Score":22282,"Num_Comments":924.0,"Date":1516406400000},{"Title":"Seriously, get and use a credit card","Score":22071,"Num_Comments":4145.0,"Date":1500595200000},{"Title":"U.S. to Cut Rates on Student Loans for First Time in 3 Years","Score":21912,"Num_Comments":67.0,"Date":1557273600000},{"Title":"In order to get the lowest lease price possible, you must learn how to calculate a lease. Here's a long and in-depth guide to how leasing works, plus real world examples from my most recent lease.","Score":21712,"Num_Comments":831.0,"Date":1517097600000},{"Title":"I researched Cash-Back credit cards so you don't have to [Effort Post]","Score":21478,"Num_Comments":1897.0,"Date":1553558400000},{"Title":"My Experience with a Timeshare (Wyndham) Sales Team in Vegas","Score":21405,"Num_Comments":1994.0,"Date":1581811200000},{"Title":"Equifax Will Allow Consumers To Lock & Unlock Their Credit Report For Free For Life","Score":21287,"Num_Comments":1365.0,"Date":1506556800000},{"Title":"You do not have to give your employer 2 weeks notice.","Score":21252,"Num_Comments":2686.0,"Date":1499990400000},{"Title":"As a former car salesman, these are the common fallacies that people used to justify purchasing a new car.","Score":21237,"Num_Comments":4138.0,"Date":1550448000000},{"Title":"I negotiated salary for the first time ever, and I got what I wanted!","Score":20942,"Num_Comments":931.0,"Date":1516579200000},{"Title":"Bill would make personal finance class a graduation requirement for SC high school students","Score":20570,"Num_Comments":723.0,"Date":1547337600000},{"Title":"My fiancé just got unexpectedly fired today and we're both now reminded why r\/personalfinance is always insisting on trying to live off one income.","Score":20555,"Num_Comments":919.0,"Date":1559779200000},{"Title":"Restaurant made a mistake and charged me $228 on a $19 bill. It's a reminder to monitor your accounts and keep your receipts.","Score":20519,"Num_Comments":1436.0,"Date":1514937600000},{"Title":"I asked Discover Card to lower my APR, just to see if they would, and they gave me 0% for 12 months. Doesn't hurt to ask.","Score":20435,"Num_Comments":1436.0,"Date":1521590400000},{"Title":"John Bogle, who founded Vanguard and revolutionized retirement savings, dies at 89","Score":20237,"Num_Comments":481.0,"Date":1547596800000},{"Title":"If you have an expensive prescription, contact the manufacturer and tell them you can't afford it.","Score":20096,"Num_Comments":827.0,"Date":1549065600000},{"Title":"Just lost my only parent today at the age of 19, I don't know what my first steps are.","Score":19879,"Num_Comments":1158.0,"Date":1511222400000},{"Title":"Macy's new employees are encouraged to open a store credit card (26% APR) to obtain their employee discount","Score":19484,"Num_Comments":1641.0,"Date":1510185600000},{"Title":"Aren't You Embarrassed?","Score":19281,"Num_Comments":1663.0,"Date":1507161600000},{"Title":"Wife had a stroke. Need to protect family and estate.","Score":18893,"Num_Comments":1175.0,"Date":1513814400000},{"Title":"My mom just left and I'm going to be homeless at the end of the month. I'm really scared and don't know what to do.","Score":18459,"Num_Comments":1396.0,"Date":1466553600000},{"Title":"Reminder: Khan Academy still has basic explanations on taxes in the U.S. This should help you with understanding tax brackets, deductions, and other related information.","Score":18237,"Num_Comments":383.0,"Date":1484006400000},{"Title":"$2,214 at Wendy’s...","Score":18228,"Num_Comments":331.0,"Date":1593907200000},{"Title":"Grandparents have lost $30k to lottery scams. They took out a $150k loan to pay for another. How can I help?","Score":18209,"Num_Comments":1562.0,"Date":1515888000000},{"Title":"I raised my credit score by 73 points in 3 months and got myself out of debt thank to this subreddit","Score":18006,"Num_Comments":437.0,"Date":1483228800000},{"Title":"What I wish people told me before I got $16,000 in CC debt","Score":17844,"Num_Comments":2191.0,"Date":1561593600000},{"Title":"How My Wife and I Never Fight Over Money","Score":17734,"Num_Comments":1658.0,"Date":1498694400000},{"Title":"I'm going into my senior year in high school and I work a LOT year round and save all my money. I should be graduating high school with a little over $30,000","Score":17686,"Num_Comments":2716.0,"Date":1502323200000},{"Title":"(CAN) I'm 17 years old, stranded in a rural home, taking care of dozens of animals on a $50 per week income, for an undetermined amount of time. I'm completely lost.","Score":17671,"Num_Comments":1778.0,"Date":1527033600000},{"Title":"How to determine if you can really afford that car","Score":17642,"Num_Comments":3261.0,"Date":1503878400000},{"Title":"I tracked the expenses for my German Shepherd Dog for one full year.","Score":17310,"Num_Comments":2001.0,"Date":1588809600000},{"Title":"UPDATE: Bank of America Refusing to Return $700+ in Fruad Charges After 180+ Days. Solved!","Score":17306,"Num_Comments":898.0,"Date":1546819200000},{"Title":"AT&T ran my credit not only without my permission, but after I explicitly stated I did not want a hard hit","Score":17096,"Num_Comments":1711.0,"Date":1543276800000},{"Title":"Wife had yearly review today. Instead of a higher wage, they converted everyone from hourly to salary, but her overall salary reduced by 14k per year.","Score":17005,"Num_Comments":1827.0,"Date":1553731200000},{"Title":"UPS just knocked on my door and I received a massive check in the mail: is this safe to deposit?","Score":16962,"Num_Comments":1438.0,"Date":1557100800000},{"Title":"What to do if you've been kicked out of your family home as a teenager: a PF guide","Score":16658,"Num_Comments":370.0,"Date":1556064000000},{"Title":"New to Reddit. 90 days sober. Trying to get my life and money back on track.","Score":16639,"Num_Comments":803.0,"Date":1511136000000},{"Title":"Don't sell the stocks in your retirement portfolio because of the drop in the market!","Score":16587,"Num_Comments":2015.0,"Date":1517875200000},{"Title":"Checking my builder's home warranty saved me $38,000 on repairs","Score":16577,"Num_Comments":647.0,"Date":1566345600000},{"Title":"Sell the things that aren't bringing value to you anymore. 5-$20 per item may not seem worth the effort but it adds up. We've focused on this at our house and have made a couple hundred bucks now.","Score":16436,"Num_Comments":1013.0,"Date":1543190400000},{"Title":"Employers Are No Longer Able to Ask About Past Salaries in Oregon, Connecticut, and Hawaii","Score":16443,"Num_Comments":526.0,"Date":1546387200000},{"Title":"Stop freaking out about \"the recession\"","Score":16410,"Num_Comments":1476.0,"Date":1565740800000},{"Title":"Are there any legitimate part time work-from-home jobs that aren't a scam?","Score":16258,"Num_Comments":2580.0,"Date":1508544000000},{"Title":"Free tax filing software program offered to anyone making <$64k.","Score":16263,"Num_Comments":663.0,"Date":1514073600000},{"Title":"ELI22: Personal finance tips for older young adults (US)","Score":16192,"Num_Comments":1384.0,"Date":1468886400000},{"Title":"New Craigslist Scam","Score":16079,"Num_Comments":1256.0,"Date":1580947200000},{"Title":"Learned a horrifying fact today about store credit cards...","Score":16037,"Num_Comments":3182.0,"Date":1513555200000},{"Title":"You can learn personal finance for free on Khan Academy","Score":15999,"Num_Comments":295.0,"Date":1592697600000},{"Title":"Turbotax deluxe charges an additional $40 to take their fee from your returns","Score":15980,"Num_Comments":1289.0,"Date":1580688000000},{"Title":"Why do so many people get excited over tax refunds when it is basically an interest free loan to the government?","Score":15969,"Num_Comments":399.0,"Date":1478995200000},{"Title":"My employer deposited my paycheck into another co-worker's bank account and is refusing to reverse the mistake for 3 days.","Score":15931,"Num_Comments":491.0,"Date":1507248000000},{"Title":"Paying attention to my 401k saved my company's employees ~$92,000","Score":15691,"Num_Comments":590.0,"Date":1563840000000},{"Title":"Be prepared if you're resigning or quitting, have been fired, or are being laid off: a PF checklist","Score":15621,"Num_Comments":695.0,"Date":1496880000000},{"Title":"We decided NOT to buy a bearded dragon.","Score":15501,"Num_Comments":1384.0,"Date":1493942400000},{"Title":"I HAVE TO move out at 18, what do I do?","Score":15471,"Num_Comments":2297.0,"Date":1553126400000},{"Title":"I saved more than $50k for law school, only to sit during the admissions test, and think that I should not invest in law school.","Score":15422,"Num_Comments":2055.0,"Date":1548633600000},{"Title":"180 days later, Bank of America is refusing to refund over $700 in fraudulent charges made in Texas while we were 800 miles away in Illinois.","Score":15309,"Num_Comments":1367.0,"Date":1546473600000},{"Title":"Successfully negotiated a 45% raise in salary, thanks pf!","Score":15277,"Num_Comments":1250.0,"Date":1458432000000},{"Title":"Bank of America is refusing to give back $9,800 to my dad's account after someone fraudulently stole his funds.","Score":15228,"Num_Comments":1469.0,"Date":1479427200000},{"Title":"GE freezes pensions for 20,000 employees - aka why I always urge people to invest in their own retirement funds","Score":15053,"Num_Comments":1238.0,"Date":1570406400000}]